var i = 2,
    x = 5;
var fn = function (x) {
    x += 3;
    return function (y) {
        console.log((x++) + y + (--i));
    }
};
var f = fn(1);
f(2);
fn(3)(4);
f(5);

/*
 * i++ VS ++i
 *  1.都是自身累加1
 *  2.i++是先取值运算再累加
 *  3.++i是先累加，把累加后的结果取值运算
 */
// var i = 10;
// console.log(5 + (i++));//=>5+10（15） i+1（i=11）
// i = 10;
// console.log(5 + (++i));//=>i+1（i=11）  5+11（16）

// var n = 2;
// console.log(1 + (++n) + 2 + (n++) + 3 + (n--) + 4 + (--n));
/*
 * 1+(++n) =>n=3 =>4
 * 4+2 =>6
 * 6+(n++) =>9 =>n=4
 * 9+3 =>12
 * 12+(n--) =>16 =>n=3
 * 16+4 =>20
 * 20+(--n) =>2 =>22
 */
